api/app/controllers/api/links_controller.rb

INSERT INTO "links" ("slug", "original_url", "created_at", "updated_at") VALUES ('u5yzpp', 'https://eee.com', '2025-09-11 14:29:47.621013', '2025-09-11 14:29:47.621013') RETURNING "id"
---
  def create
    link = Link.create!(
      original_url: params[:original_url],
      slug: SecureRandom.alphanumeric(6)
    )